In [2]:
from hossam import load_data
from pandas import DataFrame
from pandas import merge

In [4]:
고객 = load_data("customer_no_name")
고객

[data] https://data.hossam.kr/data/lab04/customer-no-name.xlsx
[desc] 데이터프레임 병합 실습을 위한 고객번호와 고객 이름에 대한 가상 데이터(인덱스와 메타데이터 없음)
[!] Cannot read metadata

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [6]:
매출 = load_data("customer_no_pay")
매출

[data] https://data.hossam.kr/data/lab04/customer-no-pay.xlsx
[desc] 데이터프레임 병합 실습을 위한 고객번호와 매출액에 대한 가상 데이터(인덱스와 메타데이터 없음)
[!] Cannot read metadata

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [8]:
merge(고객, 매출)

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [11]:
merge(고객, 매출, how = "left")

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [14]:
merge(고객,매출, how = "right")

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1005   희동   15000
3  1006  마이콜    5000
4  1008  NaN  100000
5  1001   둘리   30000

In [17]:
cd1 = load_data("customer_data1")
cd1

[data] https://data.hossam.kr/data/lab04/customer_data1.xlsx
[desc] 데이터 병합용 실습 데이터 (1) (인덱스/메타데이터 없음)
[!] Cannot read metadata

  고객명         날짜     데이터
0  민수 2018-01-01   20000
1  수영 2018-01-01  100000

In [18]:
cd2 = load_data("customer_data2")
cd2

[data] https://data.hossam.kr/data/lab04/customer_data2.xlsx
[desc] 데이터 병합용 실습 데이터 (2) (인덱스/메타데이터 없음)
[!] Cannot read metadata

  고객명  데이터
0  민수  21세
1  수영  20세

In [21]:
merge(cd1,cd2)

ValueError: You are trying to merge on int64 and object columns for key '데이터'. If you wish to proceed you should use pd.concat

In [24]:
tmp = merge(cd1, cd2,on='고객명')
tmp

  고객명         날짜   데이터_x 데이터_y
0  민수 2018-01-01   20000   21세
1  수영 2018-01-01  100000   20세

In [26]:
df_left = DataFrame({'이름':['영희','철수'],'영어':[90,82]})
df_left

   이름  영어
0  영희  90
1  철수  82

In [28]:
df_right = DataFrame({'성명':['영희','철수'], '영어':[90,82]})
df_right

   성명  영어
0  영희  90
1  철수  82

In [32]:
r3 = merge(df_left, df_right, left_on = ['이름'],  right_on = ['성명'])
r3

   이름  영어_x  성명  영어_y
0  영희    90  영희    90
1  철수    82  철수    82

In [35]:
df_left = DataFrame({'수학':[90,82]}, index=['민철','철수'])
df_left

    수학
민철  90
철수  82

In [38]:
df_right = DataFrame({'국어':[90,82]},index=['민철','철수'])
df_right

    국어
민철  90
철수  82

In [40]:
merge(df_left, df_right, left_index = True, right_index = True)

    수학  국어
민철  90  90
철수  82  82

In [42]:
merge(df_left, df_right, left_index = True, right_index = True, how = 'left')

    수학  국어
민철  90  90
철수  82  82

In [47]:
merge(df_left, df_right,  left_index = True, right_index = True, how="right")

    수학  국어
민철  90  90
철수  82  82

In [49]:
merge(df_left, df_right, left_index=True, right_index=True,
      how = "outer")

    수학  국어
민철  90  90
철수  82  82

In [51]:
df_left = DataFrame({'수학':[90,82]}, index=['민철','봉구'])
df_left

    수학
민철  90
봉구  82

In [53]:
df_right = DataFrame({"성명":['민철','철수'], '영어':[90,82]})
df_right

   성명  영어
0  민철  90
1  철수  82

In [55]:
merge(df_left, df_right, left_index = True, right_on=['성명'])

   수학  성명  영어
0  90  민철  90

In [57]:
merge(df_left, df_right, left_index = True, right_on = ['성명'],
      how = 'left')

     수학  성명    영어
0.0  90  민철  90.0
NaN  82  봉구   NaN

In [59]:
merge(df_left, df_right, left_index = True, right_on = ['성명'],
      how = 'right' )

     수학  성명  영어
0  90.0  민철  90
1   NaN  철수  82

In [61]:
tmp = merge(df_left, df_right, left_index=True, right_on=['성명'],
            how = 'outer')
tmp

       수학  성명    영어
0.0  90.0  민철  90.0
NaN  82.0  봉구   NaN
1.0   NaN  철수  82.0

In [63]:
tmp2 = tmp.set_index('성명')
tmp2

      수학    영어
성명
민철  90.0  90.0
봉구  82.0   NaN
철수   NaN  82.0

# 고객 데이터와 구매 데이터를 통합하여,연령대별 평균 구매액 분석하기

In [11]:
import pandas as pd

In [21]:
# 데이터 프레임 생성

c_df = pd.DataFrame({
    'customer_id':[101,102,103,104,105,106],
    'name':['Alice','Bob','Charlie','David','Eve','Frank'],
    'age':[25,32,45,38,29,41]
})

c_df

   customer_id     name  age
0          101    Alice   25
1          102      Bob   32
2          103  Charlie   45
3          104    David   38
4          105      Eve   29
5          106    Frank   41

In [13]:
# 구매내역 불러오기
order_history = load_data("order_history")
order_history

[data] https://data.hossam.kr/data/lab04/order_history.xlsx
[desc] 신입 데이터 분석가를 위한 실전 미션!

field        description
-----------  -------------
purchase_id  일련번호
customer_id  고객번호
item         상품명
price        금액

             customer_id             item   price
purchase_id
1                    101           Laptop  1200.0
2                    102            Mouse    25.0
3                    103         Keyboard     NaN
4                    101          Monitor   300.0
5                    104           Webcam  5000.0
6                    102          USB Hub    30.0
7                    105           Laptop  1100.0
8                    103            Mouse     NaN
9                    101     External HDD    80.0
10                   106  Docking Station   150.0

In [15]:
# 고객데이터 + 구매데이터 병합
merged= pd.merge(order_history, c_df, on='customer_id', how = 'left')
merged

   customer_id             item   price     name  age
0          101           Laptop  1200.0    Alice   25
1          102            Mouse    25.0      Bob   32
2          103         Keyboard     NaN  Charlie   45
3          101          Monitor   300.0    Alice   25
4          104           Webcam  5000.0    David   38
5          102          USB Hub    30.0      Bob   32
6          105           Laptop  1100.0      Eve   29
7          103            Mouse     NaN  Charlie   45
8          101     External HDD    80.0    Alice   25
9          106  Docking Station   150.0    Frank   41

In [16]:
sql join과 같은 방법 - merge
고객데이터 +  구매내역 merge
연령(age group) 만ㄷ르기
연령대별 평균 구매금액 분석
최종 리포트 출력 



고객데이터  + 구매 데이터 
연령(age group) 만드릭
연령대별 평균 구맥므액 분석
최종 리포트 출력

SyntaxError: invalid syntax (1922430675.py, line 1)

In [22]:
# 연령대(age group) 칼럼 만들기
bins = [0,29,39,49,59]
labes = ['20대', '30대', '40대','50대']

merged['age_group'] = pd.cut(merged['age'], bins = bins, labels=labels)
merged

NameError: name 'labels' is not defined

In [26]:
결측치처리 = order_history.copy()
mean_price = 결측치처리['price'].mean()
결측치처리['price'] = 결측치처리['price'].fillna(value=mean_price)
결측치처리

             customer_id             item     price
purchase_id
1                    101           Laptop  1200.000
2                    102            Mouse    25.000
3                    103         Keyboard   985.625
4                    101          Monitor   300.000
5                    104           Webcam  5000.000
6                    102          USB Hub    30.000
7                    105           Laptop  1100.000
8                    103            Mouse   985.625
9                    101     External HDD    80.000
10                   106  Docking Station   150.000

In [28]:
이상치처리 = 결측치처리.copy()
median_price = 이상치처리['price'].median()
이상치처리.loc[이상치처리['price'] > 1000, 'price'] = median_price
이상치처리

             customer_id             item     price
purchase_id
1                    101           Laptop  642.8125
2                    102            Mouse   25.0000
3                    103         Keyboard  985.6250
4                    101          Monitor  300.0000
5                    104           Webcam  642.8125
6                    102          USB Hub   30.0000
7                    105           Laptop  642.8125
8                    103            Mouse  985.6250
9                    101     External HDD   80.0000
10                   106  Docking Station  150.0000

In [31]:
병합 = merge(이상치처리, c_df, on = 'customer_id')
병합

   customer_id             item     price     name  age
0          101           Laptop  642.8125    Alice   25
1          102            Mouse   25.0000      Bob   32
2          103         Keyboard  985.6250  Charlie   45
3          101          Monitor  300.0000    Alice   25
4          104           Webcam  642.8125    David   38
5          102          USB Hub   30.0000      Bob   32
6          105           Laptop  642.8125      Eve   29
7          103            Mouse  985.6250  Charlie   45
8          101     External HDD   80.0000    Alice   25
9          106  Docking Station  150.0000    Frank   41

In [34]:
타입변환 = 병합.astype({'c_df':'str'})
타입변환.describe()

KeyError: "Only a column name can be used for the key in a dtype mappings argument. 'c_df' not found in columns."

In [49]:
from pandas import DataFrame
from pandas import concat

# 흩어진 판메 데이터 통합하기

In [99]:
# 1.
강남 = load_data('shop_강남')
강남

[data] https://data.hossam.kr/data/lab04/shop_강남.xlsx
[desc] 흩어진 판매 데이터 통합하기(인덱스/메타데이터 없음)
[!] Cannot read metadata

  OrderID   Product  Quantity    Price
0    A001  Keyboard        10  15000.0
1    A002     Mouse        20      NaN
2    A003   Monitor         5  75000.0
3    A004  Keyboard        12  15000.0

In [98]:
종로 = load_data('shop_종로')
종로

[data] https://data.hossam.kr/data/lab04/shop_종로.xlsx
[desc] 흩어진 판매 데이터 통합하기(인덱스/메타데이터 없음)
[!] Cannot read metadata

  OrderID   Product  Quantity  Price
0    B001     Mouse        15   8000
1    B002  Keyboard       999  14500
2    B003    Webcam        10  30000
3    B004     Mouse        18   8000

In [80]:
강남.loc[(강남['product'] == 'Mouse') & (강남['price'].isna(), 'price')] = 8000

KeyError: 'product'

In [82]:
강남.head()

  OrderID   Product  Quantity    Price
0    A001  Keyboard        10  15000.0
1    A002     Mouse        20      NaN
2    A003   Monitor         5  75000.0
3    A004  Keyboard        12  15000.0

In [93]:
강남.loc[강남('Product') == 'Keyboard' &  (종로['Quantity']==9), 'Quantity']

TypeError: 'DataFrame' object is not callable

In [101]:
강남점cp = 강남.copy()
강남점cp2 = 강남점cp['Price'].fillna(8000)
강남점cp

  OrderID   Product  Quantity    Price
0    A001  Keyboard        10  15000.0
1    A002     Mouse        20      NaN
2    A003   Monitor         5  75000.0
3    A004  Keyboard        12  15000.0

In [103]:
종로점cp = 종로.copy()
idx = 종로점cp[종로점cp['Product'] == 'Keyboard'].index[0]
종로점cp.loc[idx, 'Quantity'] = 9
종로점cp

  OrderID   Product  Quantity  Price
0    B001     Mouse        15   8000
1    B002  Keyboard         9  14500
2    B003    Webcam        10  30000
3    B004     Mouse        18   8000

In [105]:
종로점cp  = 종로.copy()
종로점cp['Quantity'] = 종로점cp['Quantity'].replace(999,9)
종로점cp

  OrderID   Product  Quantity  Price
0    B001     Mouse        15   8000
1    B002  Keyboard         9  14500
2    B003    Webcam        10  30000
3    B004     Mouse        18   8000

In [109]:
df_total = concat([강남점cp, 종로점cp], ignore_index = True)
df_total

  OrderID   Product  Quantity    Price
0    A001  Keyboard        10  15000.0
1    A002     Mouse        20      NaN
2    A003   Monitor         5  75000.0
3    A004  Keyboard        12  15000.0
4    B001     Mouse        15   8000.0
5    B002  Keyboard         9  14500.0
6    B003    Webcam        10  30000.0
7    B004     Mouse        18   8000.0

# 마케팅팀 신입사원의 첫 번째 미션

In [111]:
from pandas import DataFrame
from pandas import concat

In [114]:
vip_customer = load_data('vip_customer')

[data] https://data.hossam.kr/data/lab04/vip_customer.xlsx
[desc] VIP 고객 목록 데이터

field             description
----------------  ----------------
CustomerID        고객번호
Name              고객명
Age               나이
City              거주지역
JoinDate          가입일
TotalSpending     총 지출액
LastPurchaseDate  마지막 구매 날짜

In [123]:
vip_customer.head()

           Name  Age City   JoinDate  TotalSpending LastPurchaseDate
CustomerID
1001        김철수   35   서울 2022-01-15         150000       2023-11-01
1002        이영희   28   부산 2021-03-22          80000       2023-10-15
1003        박민준   42   서울 2022-07-10         250000       2023-11-10
1004        최지우   25   인천 2023-02-20          50000       2023-09-25
1005        정다솜   31   서울 2021-11-05         320000       2023-11-12

In [125]:
# 총 구매액이 100000 이상
cond1 = vip_customer['TotalSpending']>=100000
cond2 = vip_customer['City'] == '서울'

vip_filtered = vip_customer.loc[cond1 & cond2]
vip_filtered

           Name  Age City   JoinDate  TotalSpending LastPurchaseDate
CustomerID
1001        김철수   35   서울 2022-01-15         150000       2023-11-01
1003        박민준   42   서울 2022-07-10         250000       2023-11-10
1005        정다솜   31   서울 2021-11-05         320000       2023-11-12
1009        한지민   27   서울 2022-10-01         450000       2023-11-15
1011        임도윤   39   서울 2021-06-18         210000       2023-11-02
1013        황재민   41   서울 2022-09-05         190000       2023-11-07
1015        고은별   36   서울 2023-05-25         130000       2023-11-11

In [127]:
# 조건을 충족하는 고객 중 구매액 기준으로 내림차순 정렬
vip_sorted = vip_filtered.sort_values(by = 'TotalSpending', ascending = False)
vip_sorted

           Name  Age City   JoinDate  TotalSpending LastPurchaseDate
CustomerID
1009        한지민   27   서울 2022-10-01         450000       2023-11-15
1005        정다솜   31   서울 2021-11-05         320000       2023-11-12
1003        박민준   42   서울 2022-07-10         250000       2023-11-10
1011        임도윤   39   서울 2021-06-18         210000       2023-11-02
1013        황재민   41   서울 2022-09-05         190000       2023-11-07
1001        김철수   35   서울 2022-01-15         150000       2023-11-01
1015        고은별   36   서울 2023-05-25         130000       2023-11-11

In [129]:
# 상위 5명의 고객만 추출
top5 =  vip_sorted.head(5)
top5

           Name  Age City   JoinDate  TotalSpending LastPurchaseDate
CustomerID
1009        한지민   27   서울 2022-10-01         450000       2023-11-15
1005        정다솜   31   서울 2021-11-05         320000       2023-11-12
1003        박민준   42   서울 2022-07-10         250000       2023-11-10
1011        임도윤   39   서울 2021-06-18         210000       2023-11-02
1013        황재민   41   서울 2022-09-05         190000       2023-11-07

In [131]:
# 보고할 열(Name, City, TotalSpending)만 선택하여 출력
report = top5[['Name','City','TotalSpending']]
report

           Name City  TotalSpending
CustomerID
1009        한지민   서울         450000
1005        정다솜   서울         320000
1003        박민준   서울         250000
1011        임도윤   서울         210000
1013        황재민   서울         190000

In [132]:
# 전체 코드 한 번에 보기
# 1. 데이터 불러오기
vip = load_data('vip_customer')

# 2. 조건 설정
cond1 = vip['TotalSpending'] >= 100000
cond2 = vip['City'] == '서울'

# 3. 조건을 모두 만족하는 고객 필터링
vip_filtered = vip.loc[cond1 & cond2]

# 4. 구매액 기준 내림차순 정렬
vip_sorted = vip_filtered.sort_values(by='TotalSpending', ascending=False)

# 5. 상위 5명 추출
top5 = vip_sorted.head(5)

# 6. 보고할 컬럼만 선택
report = top5[['Name', 'City', 'TotalSpending']]
report

[data] https://data.hossam.kr/data/lab04/vip_customer.xlsx
[desc] VIP 고객 목록 데이터

field             description
----------------  ----------------
CustomerID        고객번호
Name              고객명
Age               나이
City              거주지역
JoinDate          가입일
TotalSpending     총 지출액
LastPurchaseDate  마지막 구매 날짜

           Name City  TotalSpending
CustomerID
1009        한지민   서울         450000
1005        정다솜   서울         320000
1003        박민준   서울         250000
1011        임도윤   서울         210000
1013        황재민   서울         190000